{
  "backend/main.mo": "Main backend actor implementing user profiles, matching system with mutual match detection, messaging between matched users, and access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: user profiles, profile browsing, matching system, messaging interface, and romantic visual theme with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for profile management, browsing, matching, messaging, and romantic-themed styling with OKLCH color palette.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a romantic color palette in OKLCH format for light and dark modes with warm tones.",
  "frontend/index.html": "HTML entry point for the Connect Dating application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, route definitions for all pages, theme provider, and conditional profile setup modal for new authenticated users.",
  "frontend/src/components/ConversationView.tsx": "Chat interface component displaying filtered and sorted messages between two users with message input, send functionality, and auto-scrolling to latest messages.",
  "frontend/src/components/Layout.tsx": "Application layout wrapper with header containing logo, authenticated navigation menu, login/logout button, and footer section.",
  "frontend/src/components/MatchNotification.tsx": "Displays a toast notification with a heart icon when two users match, showing a success message with the matched user's name for 5 seconds.",
  "frontend/src/components/ProfileCard.tsx": "Renders a user profile card with avatar, name, age, bio, native/target languages as badges, and Like/Pass action buttons.",
  "frontend/src/components/ProfileEditor.tsx": "Modal dialog for editing an existing user profile with fields for name, age, bio, interests, and native/target languages, saving changes via mutation.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time profile creation with required fields (name, age, bio) and optional language fields, creating a new user profile via mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles (get/save/create), active participants, matching (like/get matches), and messaging (send/get messages) with appropriate cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm romantic color palette for both light and dark modes, including primary rose/coral colors and soft peach accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/Browse.tsx": "Browse page component that displays swipeable profile cards, handles like/pass actions, filters out current user and existing matches, and shows match notifications when mutual likes occur.",
  "frontend/src/pages/Home.tsx": "Landing page component with hero section, feature cards (Browse, Match, Chat), and conditional CTAs based on authentication status.",
  "frontend/src/pages/Matches.tsx": "Displays grid of mutual matches with avatars and timestamps, provides navigation to message conversations, and shows empty state when no matches exist.",
  "frontend/src/pages/Messages.tsx": "Messages page with two-column layout showing conversation list sidebar and selected conversation view, handles partner selection from URL params or first conversation.",
  "frontend/src/pages/MyProfile.tsx": "User profile view page displaying avatar, bio, interests, and languages with edit button that toggles ProfileEditor component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, typography with Inter and Playfair Display fonts, extended border radius, shadows, and custom animations for the dating app UI.",
  "project_state.json": "Project metadata tracking a dating/adult content application with five implemented features including user profiles, browsing, matching, messaging, and romantic visual theme design."
}